КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаправлениеКонвертации/КонтурЛогистика_НаправлениеКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НаправлениеКонвертации</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееВходящее</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииОтправкиТитулов/КонтурЛогистика_СценарииОтправкиТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииОтправкиТитулов</name>
  <comment>что будет делать действие с задачей по умолчанию по конкретной настройке конвертации документа</comment>
  <enumValues>
    <name>НеПодписыватьОтправитьВФоне</name>
  </enumValues>
  <enumValues>
    <name>НеПодписыватьОтправитьВСеансе</name>
  </enumValues>
  <enumValues>
    <name>ПодписыватьОтправитьВФоне</name>
  </enumValues>
  <enumValues>
    <name>ПодписыватьОтправитьВСеансе</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЧерновик</name>
  </enumValues>
  <enumValues>
    <name>ОбработатьВходящий</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_Сценарии/КонтурЛогистика_Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_Сценарии</name>
  <enumValues>
    <name>Отправка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновика_ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаЧерновика</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаНеОбрабатывать</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаШаблона</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СпособыКонвертации/КонтурЛогистика_СпособыКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СпособыКонвертации</name>
  <enumValues>
    <name>БезДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВОрганизациюДиадок</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВПунктМаршрута</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВТранспортноеСредство</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВСотрудника</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВДоговор</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВПодразделениеДиадок</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВЛицензию</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьВГорючеСмазочныйМатериал</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьПоТаблицеСоответствий</name>
  </enumValues>
  <enumValues>
    <name>КонвертироватьМассивСтруктур</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ИнициаторыПереадресовки/КонтурЛогистика_ИнициаторыПереадресовки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ИнициаторыПереадресовки</name>
  <enumValues>
    <name>Грузоотправитель</name>
  </enumValues>
  <enumValues>
    <name>Грузополучатель</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_МетодыОпределенияМассы/КонтурЛогистика_МетодыОпределенияМассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_МетодыОпределенияМассы</name>
  <enumValues>
    <name>_01</name>
  </enumValues>
  <enumValues>
    <name>_02</name>
  </enumValues>
  <enumValues>
    <name>_03</name>
    <comment>расчет на основании данных геометрического обмера согласно загружаемому грузу и (или) технической документации на него и (или) данным измерительных приборов, имеющих регистрацию как средство измерения и прошедших соответствующую периодическую поверку</comment>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ФункцииЗаказаЗаявки/КонтурЛогистика_ФункцииЗаказаЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ФункцииЗаказаЗаявки</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипСтоимостиГруза/КонтурЛогистика_ТипСтоимостиГруза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипСтоимостиГруза</name>
  <enumValues>
    <name>ОбъявленнаяСтоимость</name>
    <comment>Объявленная стоимость груза</comment>
  </enumValues>
  <enumValues>
    <name>ДействительнаяСтоимость</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыВладенияТранспортнымСредством/КонтурЛогистика_ВидыВладенияТранспортнымСредством.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыВладенияТранспортнымСредством</name>
  <enumValues>
    <name>Собственность_1</name>
  </enumValues>
  <enumValues>
    <name>СовместнаяСобственностьСупругов_2</name>
  </enumValues>
  <enumValues>
    <name>Аренда_3</name>
  </enumValues>
  <enumValues>
    <name>Лизинг_4</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПользование_5</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_КонвертацияТиповыеКЛ/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область КонвертацияДокументов

// См. КонтурЛогистика_КонвертацияТиповые.ПоддерживаемыеТипыДокументовКонфигурации1С
//
Функция ПоддерживаемыеТипыДокументовКонфигурации1С(ТипДокументаЛогистика, СпецСценарий) Экспорт
	
	ТипыДокументовКонфигурации1С = Новый Массив;
	
	Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(ТипДокументаЛогистика) Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_ТранспортнаяНакладная");
		
	ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(ТипДокументаЛогистика)
		Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоЗЗ(ТипДокументаЛогистика) Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_ЗаданиеНаПеревозку");
	
	ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЭ(ТипДокументаЛогистика) Тогда
		 
			ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_РеализацияТоваровУслуг");
			ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_ТранспортнаяНакладная");
					
	КонецЕсли;
	
	Возврат ТипыДокументовКонфигурации1С;
	
КонецФункции

// См. КонтурЛогистика_КонвертацияТиповые.ЗаполнитьБазовыеНастройкиКонвертации
//
Процедура ЗаполнитьБазовыеНастройкиКонвертации(Контекст) Экспорт
	
	Если Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
		
		Если Контекст.ТипДокумента1С = Неопределено Тогда
			
			// Если отбор = Неопределено, то подразумеваем, что есть какая то настройка для документа
			Контекст.ЕстьТиповаяКонвертация = Истина;
			
		ИначеЕсли Контекст.ТипДокумента1С = "УчетнаяСистема_ТранспортнаяНакладная" Тогда
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьОрганизация = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьКонтрагент = "Грузополучатель";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузоотправитель = "Грузоотправитель";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьПеревозчик = "Перевозчик";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузополучатель = "Грузополучатель";
			
		КонецЕсли;
		
	ИначеЕсли Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
		Или Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02 Тогда
		
		Если Контекст.ТипДокумента1С = Неопределено Тогда
			
			// Если отбор = Неопределено, то подразумеваем, что есть какая то настройка для документа
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Если Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
				Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;				
			Иначе
				Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.НеПодписыватьОтправитьВСеансе;
			КонецЕсли;
			
		ИначеЕсли Контекст.ТипДокумента1С = "УчетнаяСистема_ЗаданиеНаПеревозку" Тогда
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Если Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
				Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;				
			Иначе
				Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.НеПодписыватьОтправитьВСеансе;
			КонецЕсли;
			
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьОрганизация = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузоотправитель = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьПеревозчик = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузополучатель = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьМестоПогрузки = "Склад";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьВодитель = "Водитель";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьТранспортноеСредство = "ТранспортноеСредство";
			
		КонецЕсли;
		
	ИначеЕсли Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1 Тогда
		
		Если Контекст.ТипДокумента1С = Неопределено Тогда
			
			// Если отбор = Неопределено, то подразумеваем, что есть какая то настройка для документа
			Контекст.ЕстьТиповаяКонвертация = Истина;
			
		ИначеЕсли Контекст.ТипДокумента1С = "УчетнаяСистема_ЗаданиеНаПеревозку" Тогда
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьОрганизация = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьКонтрагент = "Контрагент";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузоотправитель = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьПеревозчик = "Перевозчик";
			
		КонецЕсли;
	
	ИначеЕсли Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1 Тогда	
		
		Если Контекст.ТипДокумента1С = Неопределено Тогда
			
			// Если отбор = Неопределено, то подразумеваем, что есть какая то настройка для документа
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Контекст.ДокументыОснованияВложенныхДокументов.РассчитыватьВложенныеОснования = Истина;

		ИначеЕсли Контекст.ТипДокумента1С = "УчетнаяСистема_РеализацияТоваровУслуг" Тогда
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Контекст.ДокументыОснованияВложенныхДокументов.РассчитыватьВложенныеОснования = Истина;
			Контекст.ДокументыОснованияВложенныхДокументов.ПутьРеквизитДокументОснования = "Ссылка";
			
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьОрганизация = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузоотправитель = "Грузоотправитель";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьПеревозчик = "ПеревозчикПартнер";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузополучатель = "Грузополучатель";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьМестоПогрузки = "Склад";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьДатаТрн = "Дата";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьНомерТрн = "НомерПЭ";
		
		ИначеЕсли Контекст.ТипДокумента1С = "УчетнаяСистема_ТранспортнаяНакладная" Тогда
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
			Контекст.ДокументыОснованияВложенныхДокументов.РассчитыватьВложенныеОснования = Истина;
			Контекст.ДокументыОснованияВложенныхДокументов.ИмяТЧДокументыОснования = "ДокументыОснования";
			Контекст.ДокументыОснованияВложенныхДокументов.ПутьРеквизитДокументОснования = "ДокументОснование";
			
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьОрганизация = "Организация";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузоотправитель = "Грузоотправитель";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьПеревозчик = "Перевозчик";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьГрузополучатель = "Грузополучатель";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьДатаТрн = "Дата";
			Контекст.ПутиРеквизитовУчетногоДокумента.ПутьНомерТрн = "Номер";
					
		КонецЕсли;
		
		ИначеЕсли Контекст.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_ЗаявкаНаМаршрут Тогда	
		
		Если Контекст.ТипДокумента1С = Неопределено
			Или Контекст.ТипДокумента1С = "УчетнаяСистема_РеализацияТоваровУслуг" Тогда			
			
			Контекст.ЕстьТиповаяКонвертация = Истина;
			Контекст.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
			Контекст.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Контекст.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
			
		 КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// См. КонтурЛогистика_КонвертацияТиповые.НайтиГлавныйДокументПоДокументуУчетнойСистемы
//
Функция НайтиГлавныйДокументПоДокументуУчетнойСистемы(ДокументОснование, КонтекстНастройкиКонвертации, Разделитель, ДокументОбъект) Экспорт
	
	ГлавныйДокумент = Неопределено;
	
	Если КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ТранспортнаяНакладная" Тогда
		
		НомерДокумента = ДокументОснование.Номер;
		ДатаДокумента = ДокументОснование.Дата;
		Грузоотправитель = ДокументОснование.Грузоотправитель;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ЗаданиеНаПеревозку" Тогда
		
		НомерДокумента = ДокументОснование.Номер;
		ДатаДокумента = ДокументОснование.Дата;
		Грузоотправитель = ДокументОснование.Организация;
		
	Иначе
		
		НомерДокумента = Неопределено;
		ДатаДокумента = Неопределено;
		Грузоотправитель = Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерДокумента) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Грузоотправитель", Грузоотправитель);
		Запрос.УстановитьПараметр("НомерТрН", НомерДокумента);
		Запрос.УстановитьПараметр("ДатаТрН", ДатаДокумента);
		Запрос.УстановитьПараметр("Разделитель", Разделитель);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная КАК КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная
		|ГДЕ
		|	(КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Грузоотправитель = &Грузоотправитель
		|			ИЛИ &Грузоотправитель = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
		|			ИЛИ КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка))
		|	И КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.НомерТрН = &НомерТрН
		|	И (КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ДатаТрН = &ДатаТрН
		|			ИЛИ &ДатаТрН = ДАТАВРЕМЯ(1, 1, 1))
		|	И НЕ КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ПометкаУдаления
		|	И (КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.Разделитель = &Разделитель
		|			ИЛИ &Разделитель = НЕОПРЕДЕЛЕНО)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ГлавныйДокумент = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ГлавныйДокумент;
	
КонецФункции

// См. КонтурЛогистика_КонвертацияТиповые.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы
//
Процедура ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ДокументОбъект, ДокументОснование, КонтекстНастройкиКонвертации, Переменные) Экспорт
	
	Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ТранспортнаяНакладная" Тогда
		
		ДокументОбъект.НомерТрН = ДокументОснование.Номер;
		ДокументОбъект.ДатаТрН = ДокументОснование.Дата;
		ДокументОбъект.ДатаЗак = ДокументОснование.Дата;
		ДокументОбъект.ЭтоЭкспедиция = Ложь;
		ДокументОбъект.ДатаВремяДоставки = ДокументОснование.ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо;
		ДокументОбъект.МаршрутТекст = ДокументОснование.АдресДоставкиЗначение;
		
		ДокументОбъект.Грузоотправитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Грузоотправитель, "Грузоотправитель",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.Перевозчик = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Перевозчик, "Перевозчик",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.Грузополучатель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Грузополучатель, "Грузополучатель",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.ЭкспедицияЗаказчик = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.ЗаказчикПеревозки, "ЭкспедицияЗаказчик",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.ТранспортноеСредство = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.ЗаданиеНаПеревозку.ТранспортноеСредство, "ТранспортноеСредство",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВТранспортноеСредство,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.МестоПогрузки = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.ЗаданиеНаПеревозку.Склад, "МестоПогрузки",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.МестоДоставки = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.АдресДоставкиЗначение, "МестоДоставки",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
			ДокументОснование, ДокументОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

// См. КонтурЛогистика_КонвертацияТиповые.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы
//
Процедура ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ДокументОбъект, КонтекстНастройкиКонвертации, Переменные) Экспорт
	
	ДокументОснование = ДокументОбъект.ДокументОснование;
	
	Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ТранспортнаяНакладная" Тогда
		
		ДокументОбъект.ИнициаторПереадресации = Перечисления.КонтурЛогистика_ИнициаторыПереадресовки.Грузоотправитель;
		ДокументОбъект.ДатаВремяПодачиПлановая = ДокументОснование.ЗаданиеНаПеревозку.ДатаВремяРейсаПланС;
		ДокументОбъект.ДатаВремяПрибытия = ДокументОснование.ЗаданиеНаПеревозку.ДатаВремяРейсаПланС;
		ДокументОбъект.ДатаВремяУбытия = ДокументОснование.ЗаданиеНаПеревозку.ДатаВремяРейсаПланС;
		ДокументОбъект.МассаБруттоКг = ДокументОснование.МассаБрутто;
		ДокументОбъект.МетодОпределенияМассы = Перечисления.КонтурЛогистика_МетодыОпределенияМассы._03;
		ДокументОбъект.ПользовательПодписант = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
		ДокументОбъект.ПерегрузкаЗапрещена = Истина;
		
		// ТЧ ТелефоныПереадресующего
		Если ЗначениеЗаполнено(ДокументОбъект.ДокументЭТРН.Грузоотправитель) Тогда
			НоваяСтрока = ДокументОбъект.ТелефоныПереадресующего.Добавить();
			НоваяСтрока.Телефон = ДокументОбъект.ДокументЭТРН.Грузоотправитель.ТелефонОсновной;
		КонецЕсли;
		
		ДокументОбъект.Водитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.ЗаданиеНаПеревозку.Водитель, "Водитель",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВСотрудника,
			ДокументОснование, ДокументОбъект);
		
		// ТЧ Товары
		Для Каждого ТекДокОснование Из КонтурЛогистика_КонвертацияТиповые.ОснованияДляЗаполненияТоваровТрН(ДокументОбъект, ДокументОснование) Цикл
			
			Для Каждого Элемент Из ТекДокОснование.ДокументыОснования Цикл
				
				ТЧТоварыОснования = Элемент.ДокументОснование.Товары;
				
				Для Каждого ТоварОснования Из ТЧТоварыОснования Цикл
					
					Если Не КонтурЛогистика_КонвертацияСервер.СтрокаТоваровПодходитПоРазделителю(
							ТоварОснования, КонтекстНастройкиКонвертации, ДокументОбъект, ДокументОбъект.Разделитель) Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = ДокументОбъект.Товары.Добавить();
					Попытка 
						НоваяСтрока.ИдентификаторСтроки = ТоварОснования.ИдентификаторСтроки;
					Исключение
						НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
					КонецПопытки;
					НоваяСтрока.Номенклатура = ТоварОснования.Номенклатура;
					НоваяСтрока.Количество = ТоварОснования.КоличествоУпаковок;
					НоваяСтрока.УпаковкаЕдиницаИзмерения = ТоварОснования.Упаковка;
					НоваяСтрока.Характеристика = ТоварОснования.Характеристика;
					НоваяСтрока.СостояниеГруза = "Без замечаний";
					НоваяСтрока.Учитывать = Истина;
					НоваяСтрока.КодТНВЭД = ТоварОснования.КодТНВЭД;
					НоваяСтрока.УчетГрузаВГИС = Ложь;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли (КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02)
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ЗаданиеНаПеревозку" Тогда
		
		ДокументОбъект.СрокПЛ = ДокументОснование.Дата;
		ДокументОбъект.ДатаПЛ = ДокументОснование.Дата;
		ДокументОбъект.НомерПЛ = ДокументОснование.Номер;
		
		ДокументОбъект.Водитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Водитель, "Водитель",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВСотрудника,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.ТранспортноеСредство = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.ТранспортноеСредство, "ТранспортноеСредство",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВТранспортноеСредство,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.ЛицоОформившееПЛ = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Организация, "ЛицоОформившееПЛ",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
			ДокументОснование, ДокументОбъект);
		
		Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
			ДокументОбъект.МестоОтправления = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
				ДокументОснование.Склад, "МестоОтправления",
				Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
				ДокументОснование, ДокументОбъект);
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
		Или КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5 Тогда
		
		ДокументОбъект.ДатВрОдометр = ТекущаяДатаСеанса();
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
		Или КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6
		Или КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02
		Или КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02 Тогда
		
		ДокументОбъект.ДатВрПрМО = ТекущаяДатаСеанса();
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02 Тогда
		
		ДокументОбъект.ДатВрКонтТехСост = ТекущаяДатаСеанса();
		ДокументОбъект.ДатВрВыпНаЛин = ТекущаяДатаСеанса();
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02 Тогда
		
		ДокументОбъект.ДтВрВозвр = ТекущаяДатаСеанса();
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ЗаданиеНаПеревозку" Тогда
		
		ДокументОбъект.ДатВрПод = ДокументОснование.ДатаВремяРейсаПланС;
		ДокументОбъект.Функция = Перечисления.КонтурЛогистика_ФункцииЗаказаЗаявки.Заказ;
		ДокументОбъект.ДатаЗак = ДокументОснование.Дата;
		ДокументОбъект.ТСТип = ДокументОснование.ТранспортноеСредство.Тип;
		ДокументОбъект.ТСГрузопод = ДокументОснование.ТранспортноеСредство.ГрузоподъемностьВТоннах;
		ДокументОбъект.ТСВместим = ДокументОснование.ТранспортноеСредство.ВместимостьВКубическихМетрах;
		ДокументОбъект.ПредСрПрвз = "Отсутствуют";
		ДокументОбъект.ПрвзПищПрод = "Отсутствуют";
		ДокументОбъект.НомЗак = ДокументОснование.Номер;
		
		ДокументОбъект.Перевозчик = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Перевозчик, "Перевозчик",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
			ДокументОснование, ДокументОбъект);
		
		ДокументОбъект.ПунктПод = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Склад, "ПунктПод",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
			ДокументОснование, ДокументОбъект);
			
		ДокументОбъект.Грузоотправитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Организация, "Грузоотправитель",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
			ДокументОснование, ДокументОбъект);
		
		// ТЧ Товары
		Для Каждого ТекДокОснование Из КонтурЛогистика_КонвертацияТиповые.ОснованияДляЗаполненияТоваровЗЗ(ДокументОбъект, ДокументОснование) Цикл
			
			Для Каждого Элемент Из ТекДокОснование.Распоряжения Цикл
				
				ТЧТоварыОснования = Элемент.Распоряжение.Товары;
				
				Для Каждого ТоварОснования Из ТЧТоварыОснования Цикл
					
					Если Не КонтурЛогистика_КонвертацияСервер.СтрокаТоваровПодходитПоРазделителю(
							ТоварОснования, КонтекстНастройкиКонвертации, ДокументОбъект, ДокументОбъект.Разделитель) Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = ДокументОбъект.Товары.Добавить();
					Попытка 
						НоваяСтрока.ИдентификаторСтроки = ТоварОснования.ИдентификаторСтроки;
					Исключение
						НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
					КонецПопытки;
					НоваяСтрока.Номенклатура = ТоварОснования.Номенклатура;
					НоваяСтрока.Количество = ТоварОснования.Количество;
					НоваяСтрока.УпаковкаЕдиницаИзмерения = ТоварОснования.Упаковка;
					НоваяСтрока.Характеристика = ТоварОснования.Характеристика;
					НоваяСтрока.МетодОпределенияМассы = Перечисления.КонтурЛогистика_МетодыОпределенияМассы._03;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		// ТЧ ТоварыПунктыПогрузкиВыгрузки
		НоваяСтрока = ДокументОбъект.АдрПункт.Добавить();
		НоваяСтрока.Выгрузка = Истина;
		НоваяСтрока.ПунктМаршрута = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
			ДокументОснование.Склад, "ПунктМаршрута",
			Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
			ДокументОснование, НоваяСтрока);
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул2 Тогда
		
		ДокументОбъект.Расчет = "Аванс";
		
		Если ЗначениеЗаполнено(ДокументОбъект.Титул1.ДокументОснование) Тогда
			
			Водитель = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
				ДокументОбъект.Титул1.ДокументОснование.Водитель, "Водитель",
				Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВСотрудника,
				ДокументОснование, ДокументОбъект);
			
			// СвЛицОргПрвз
			ДокументОбъект.СвЛицОргПрвз = Водитель;
			
			// ТранспортноеСредство
			ДокументОбъект.ТранспортноеСредство = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
				ДокументОбъект.Титул1.ДокументОснование.ТранспортноеСредство, "ТранспортноеСредство",
				Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВТранспортноеСредство,
				ДокументОснование, ДокументОбъект);
			
			// ТЧ Водители
			НоваяСтрокаВодитель = ДокументОбъект.Водители.Добавить();
			НоваяСтрокаВодитель.СвВодит = Водитель;
			
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_ЗаявкаНаМаршрут
 			И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_РеализацияТоваровУслуг" Тогда
		
		ДокументОбъект.НомДок = ДокументОснование.НомерПЭ;
		ДокументОбъект.ДатаДок = ДокументОснование.Дата;
		
		ДокументОбъект.ДогТрЭксп = ДокументОснование.Договор;
		
		ВОрганизациюДиадок = Новый Структура("СвКлт, СвЭксп, СвГО, СвГП", "Организация", "ПеревозчикПартнер", "Грузоотправитель", "Грузополучатель"); 
		Для Каждого Элемент Из ВОрганизациюДиадок Цикл
			ДокументОбъект[Элемент.Ключ] = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
				ДокументОснование[Элемент.Значение], Элемент.Ключ,
				Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
				ДокументОснование, ДокументОбъект);
		КонецЦикла;
		
		ВПунктМаршрута = Новый Структура("АдрГруз, АдрПунктНазн", "АдресДоставкиПеревозчика", "АдресДоставки"); 
		Для Каждого Элемент Из ВПунктМаршрута Цикл
			ДокументОбъект[Элемент.Ключ] = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
				ДокументОснование[Элемент.Значение], Элемент.Ключ,
				Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВПунктМаршрута,
				ДокументОснование, ДокументОбъект);
		КонецЦикла;
		
		ДокументОбъект.ВрДостГрС = ДокументОснование.ВремяДоставкиС;
		ДокументОбъект.ВрДостГрПо = ДокументОснование.ВремяДоставкиПо;
		
		Валюта = КонтурЛогистика_КонвертацияСервер.КонвертироватьВалютуИзЛогистикиВ1С("643", "руб");
		ДокументОбъект.ВалютаУчетаГруза = Валюта;
		ДокументОбъект.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ДействительнаяСтоимость;
		// ТЧ Товары
		Для Каждого ТоварОснования Из ДокументОснование.Товары Цикл
			
			// При разделении ПЭ_ЗаявкаНаМаршрут — только строки текущего разделителя
			Если Не КонтурЛогистика_КонвертацияСервер.СтрокаТоваровПодходитПоРазделителю(
					ТоварОснования, КонтекстНастройкиКонвертации, ДокументОбъект, ДокументОбъект.Разделитель) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
			НоваяСтрока.Номенклатура = ТоварОснования.Номенклатура;
			НоваяСтрока.Количество = ТоварОснования.Количество;
			НоваяСтрока.УпаковкаЕдиницаИзмерения = ТоварОснования.Упаковка;
			НоваяСтрока.Характеристика = ТоварОснования.Характеристика;
			
			НоваяСтрока.СтоимостьГруза = ТоварОснования.Сумма;
			НоваяСтрока.ВалютаУчетаГруза = Валюта;
			НоваяСтрока.ТипСтоимости = Перечисления.КонтурЛогистика_ТипСтоимостиГруза.ДействительнаяСтоимость;
			
		КонецЦикла;
	
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1
 		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_РеализацияТоваровУслуг" Тогда
		
		    ДокументОбъект.НомДок = ДокументОснование.НомерПЭ;
			ДокументОбъект.ДатаДок = ДокументОснование.Дата;
		
			ДокументОбъект.ДогТрЭксп = ДокументОснование.Договор;
			
			ВОрганизациюДиадок = Новый Структура("СвКлиент, СвЭксп", "Организация", "ПеревозчикПартнер"); 
			Для Каждого Элемент Из ВОрганизациюДиадок Цикл
				ДокументОбъект[Элемент.Ключ] = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
				ДокументОснование[Элемент.Значение], Элемент.Ключ,
				Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
				ДокументОснование, ДокументОбъект);
			КонецЦикла;
		
			НоваяСтрока = ДокументОбъект.ДокументыОснованияМаршрутов.Добавить();
	 		НоваяСтрока.ДокументОснование = ДокументОснование;
			
 	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1
 		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ТранспортнаяНакладная" Тогда
			
			ДокументОбъект.НомДок = ДокументОснование.Номер;
			ДокументОбъект.ДатаДок = ДокументОснование.Дата;
			
			ВОрганизациюДиадок = Новый Структура("СвКлиент, СвЭксп", "Организация", "Перевозчик");
			Для Каждого Элемент Из ВОрганизациюДиадок Цикл
				ДокументОбъект[Элемент.Ключ] = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
					ДокументОснование[Элемент.Значение], Элемент.Ключ,
					Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
					ДокументОснование, ДокументОбъект);
			КонецЦикла;
			
			// Основания маршрутов — связанные реализации/перемещения из ТН
			Для Каждого СтрокаОснования Из ДокументОснование.ДокументыОснования Цикл
				
				// При разделении ПЭ_Титул1 — только строки текущего разделителя
				Если Не КонтурЛогистика_КонвертацияСервер.СтрокаТоваровПодходитПоРазделителю(
					СтрокаОснования, КонтекстНастройкиКонвертации, ДокументОбъект, ДокументОбъект.Разделитель) Тогда
					Продолжить;
				КонецЕсли;
						
				НоваяСтрока = ДокументОбъект.ДокументыОснованияМаршрутов.Добавить();
				НоваяСтрока.ДокументОснование = СтрокаОснования.ДокументОснование;
				
			КонецЦикла;
 	
	КонецЕсли;
	
КонецПроцедуры

// См. КонтурЛогистика_КонвертацияТиповые.ВычислитьРеквизитыДокументаОснования
//
Функция ВычислитьРеквизитыДокументаОснования(ИменаРеквизитов, ДокументОбъект, КонтекстНастройкиКонвертации) Экспорт
	
	ЗначенияРеквизитов = Новый Структура;
	
	ДокументОснование = ДокументОбъект.ДокументОснование;
	
	Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ТранспортнаяНакладная" Тогда
		
		Если ИменаРеквизитов.Найти("Грузоотправитель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Грузоотправитель", ДокументОснование.Грузоотправитель);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Перевозчик") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Перевозчик", ДокументОснование.Перевозчик);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Грузополучатель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Грузополучатель", ДокументОснование.Грузополучатель);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("ТранспортноеСредство") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("ТранспортноеСредство", ДокументОснование.ЗаданиеНаПеревозку.ТранспортноеСредство);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("МестоПогрузки") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("МестоПогрузки", ДокументОснование.ЗаданиеНаПеревозку.Склад);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("МестоДоставки") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("МестоДоставки", ДокументОснование.АдресДоставкиЗначение);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("ЭкспедицияЗаказчик") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("ЭкспедицияЗаказчик", ДокументОснование.ЗаказчикПеревозки);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Водитель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Водитель", ДокументОснование.ЗаданиеНаПеревозку.Водитель);
		КонецЕсли;
		
	ИначеЕсли (КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
			Или КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02)
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ЗаданиеНаПеревозку" Тогда
		
		Если ИменаРеквизитов.Найти("ЛицоОформившееПЛ") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("ЛицоОформившееПЛ", ДокументОснование.Организация);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Водитель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Водитель", ДокументОснование.Водитель);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("ТранспортноеСредство") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("ТранспортноеСредство", ДокументОснование.ТранспортноеСредство);
		КонецЕсли;
		
		Если КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
			Если ИменаРеквизитов.Найти("МестоОтправления") <> Неопределено Тогда
				ЗначенияРеквизитов.Вставить("МестоОтправления", ДокументОснование.Склад);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_ЗаданиеНаПеревозку" Тогда
		
		Если ИменаРеквизитов.Найти("Перевозчик") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Перевозчик", ДокументОснование.Перевозчик);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("Грузоотправитель") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("Грузоотправитель", ДокументОснование.Организация);
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1
		И КонтекстНастройкиКонвертации.ТипДокумента1С = "УчетнаяСистема_РеализацияТоваровУслуг" Тогда
		
		Если ИменаРеквизитов.Найти("АдрГруз") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("АдрГруз", ДокументОснование.АдресДоставкиПеревозчика);
		КонецЕсли;
		
		Если ИменаРеквизитов.Найти("АдрПунктНазн") <> Неопределено Тогда
			ЗначенияРеквизитов.Вставить("АдрПунктНазн", ДокументОснование.АдресДоставки);
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

#КонецОбласти

#Область КонвертацияСправочников

// См. КонтурЛогистика_КонвертацияТиповые.ПоддерживаемыеТипыСправочниковКонфигурации1С
//
Функция ПоддерживаемыеТипыСправочниковКонфигурации1С(ТипСправочникаЛогистика) Экспорт
	
	ТипыДокументовКонфигурации1С = Новый Массив;
	
	Если ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_ФизическиеЛица");
		
	ИначеЕсли ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_Контрагенты");
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_Организации");
		
	ИначеЕсли ТипСправочникаЛогистика = "КонтурЛогистика_ПунктыМаршрута" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_Склады");
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_ТранспортнаяНакладная");
		
	ИначеЕсли ТипСправочникаЛогистика = "КонтурЛогистика_ТранспортныеСредства" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_ТранспортныеСредства");
		
	ИначеЕсли ТипСправочникаЛогистика = "КонтурЛогистика_Договоры" Тогда
		
		ТипыДокументовКонфигурации1С.Добавить("УчетнаяСистема_ДоговорыКонтрагентов");
		
	КонецЕсли;
	
	Возврат ТипыДокументовКонфигурации1С;
	
КонецФункции

// См. КонтурЛогистика_КонвертацияТиповые.ЗаполнитьБазовыеНастройкиКонвертацииСправочника
//
Процедура ЗаполнитьБазовыеНастройкиКонвертацииСправочника(КонтекстНастройкиКонвертации) Экспорт
	
	Если КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_ФизическиеЛица") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_Контрагенты"
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_Организации") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ПунктыМаршрута"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_Склады"
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_ТранспортнаяНакладная") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ТранспортныеСредства"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_ТранспортныеСредства") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Договоры"
		И (КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = Неопределено
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_ДоговорыКонтрагентов") Тогда
		
		КонтекстНастройкиКонвертации.ЕстьТиповаяКонвертация = Истина;
		КонтекстНастройкиКонвертации.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
	КонецЕсли;
	
КонецПроцедуры

// См. КонтурЛогистика_КонвертацияТиповые.ВычислитьРеквизитыСправочникаЛогистикиПоУчетномуОбъекту
//
Процедура ВычислитьРеквизитыСправочникаЛогистикиПоУчетномуОбъекту(КонтекстНастройкиКонвертации, Параметры, Результат) Экспорт
	
	УчетныйОбъект = Параметры.УчетныйОбъект;
	
	// Могуть быть незаполненными!
	ДокументОснование = Параметры.ДокументОснование;  // От заполненности этого параметра зависит заполненность РеквизитаТитула!
	ДокументОбъект = Параметры.ДокументОбъект;
	Переменные = Параметры.Переменные;
	
	ОбновлятьРеквизиты = КонтекстНастройкиКонвертации.ОбновлятьРеквизитыИзУчетнойСистемы;
	
	Если КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Сотрудники"
		И КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_ФизическиеЛица" Тогда
		
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВУНомер", УчетныйОбъект.ВУНомер, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВУДатаВыдачи", УчетныйОбъект.ВУДатаВыдачи, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ДатаРождения", УчетныйОбъект.ДатаРождения, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Имя", УчетныйОбъект.Имя, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ИНН", УчетныйОбъект.ИНН, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Отчество", УчетныйОбъект.Отчество, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВУСерия", УчетныйОбъект.ВУСерия, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Фамилия", УчетныйОбъект.Фамилия, ОбновлятьРеквизиты);
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"РольВодитель", (КонтекстНастройкиКонвертации.РеквизитТитула = "Водитель"), ОбновлятьРеквизиты);
		КонецЕсли;	
			
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Должность", "Водитель", ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ТелефонОсновной", УчетныйОбъект.Телефон, ОбновлятьРеквизиты);
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ОрганизацииДиадок" Тогда
		
		Если КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_Контрагенты"
			Или КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_Организации" Тогда
			
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"ИНН", УчетныйОбъект.ИНН, ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"КПП", УчетныйОбъект.КПП, ОбновлятьРеквизиты);
			
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ПунктыМаршрута" Тогда
		
		Если КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_Склады" Тогда
			
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"АдресИнфАдрес", УчетныйОбъект.АдресСтрока, ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"АдресИнфКодСтраны", Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду("643"), ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"Отправление", Истина, ОбновлятьРеквизиты);
			
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.УчетнаяСистема_ТранспортнаяНакладная") Тогда
					Собственник = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
						ДокументОснование.Грузоотправитель, "Грузоотправитель",
						Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
						ДокументОснование, ДокументОбъект);
				ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.УчетнаяСистема_ЗаданиеНаПеревозку") Тогда
					Собственник = КонтурЛогистика_КонвертацияТиповые.КонвертироватьЗначениеВОбъектЛогистики(
						ДокументОснование.Организация, "Грузоотправитель",
						Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок,
						ДокументОснование, ДокументОбъект);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Собственник) Тогда
					КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
						"Собственник", Собственник, ОбновлятьРеквизиты);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_ТранспортнаяНакладная" Тогда
			
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
					"АдресИнфАдрес", ДокументОснование.АдресДоставкиЗначение, ОбновлятьРеквизиты);
			КонецЕсли;	
				
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"АдресИнфКодСтраны", Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду("643"), ОбновлятьРеквизиты);
			КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
				"Прибытие", Истина, ОбновлятьРеквизиты);
			
		КонецЕсли;
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_ТранспортныеСредства"
		И КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_ТранспортныеСредства" Тогда
		
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"VIN", УчетныйОбъект.VIN, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"РегНомер", УчетныйОбъект.РегНомер, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"СТС", УчетныйОбъект.СТС, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВидВладения", Перечисления.КонтурЛогистика_ВидыВладенияТранспортнымСредством.Собственность_1, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ВместимостьКубМ", УчетныйОбъект.ВместимостьВКубическихМетрах, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ГрузоподъемностьТонн", УчетныйОбъект.ГрузоподъемностьВТоннах, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"МаркаТС", УчетныйОбъект.Марка, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ТипТС", УчетныйОбъект.Тип, ОбновлятьРеквизиты);
		
	ИначеЕсли КонтекстНастройкиКонвертации.ТипСправочникаЛогистика = "КонтурЛогистика_Договоры"
		И КонтекстНастройкиКонвертации.ТипСправочникаИлиДокументаУС = "УчетнаяСистема_ДоговорыКонтрагентов" Тогда
		
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ДатаДокумента", УчетныйОбъект.Дата, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Контрагент", УчетныйОбъект.Контрагент, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"КонтрагентИНН", УчетныйОбъект.Контрагент.ИНН, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Наименование", УчетныйОбъект.Наименование, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"НомерДокумента", УчетныйОбъект.Номер, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"Организация", УчетныйОбъект.Организация, ОбновлятьРеквизиты);
		КонтурЛогистика_КонвертацияТиповые.ДобавитьВычесленныйРеквизит(Результат.ВычисленныеРеквизиты,
			"ОрганизацияИНН", УчетныйОбъект.Организация.ИНН, ОбновлятьРеквизиты);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Заполняет габариты и массу записи базового соответствия номенклатуры
//
// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.КонтурЛогистика_БазовыеСоответствияНоменклатуры
//
Процедура ЗаполнитьВесогабаритныеПараметрыБазовогоСоответствия(Запись) Экспорт

	// Заглушка
	
КонецПроцедуры

#КонецОбласти
